export const grammarSigns = {
    "Глагол": [
        "1 лицо",
        "2 лицо",
        "3 лицо",
        "единственное число",
        "множественное число",
        "настоящее время",
        "прошедшее время",
        "будущее время",
        "мужской род",
        "женский род",
        "средний род",
        "повелительное наклонение",
        "изъявительное наклонение",
        "совершенный вид",
        "несовершенный вид",
        "непереходный",
        "переходный",
        "инфинитив"
    ],

    "Деепричастие" : [
        "настоящее время",
        "прошедшее время",
        "будущее время",
        "совершенный вид",
        "несовершенный вид",
        "переходный",
        "непереходный"
    ],

    "Компаратив (сравнительная степень)" : [],

    "Междометие" : [],

    "Местоимение": [
        "1 лицо",
        "2 лицо",
        "3 лицо",
        "именительный падеж",
        "родительный падеж",
        "дательный падеж",
        "винительный падеж",
        "творительный падеж",
        "предложный падеж",
        "единственное число",
        "множественное число",
        "мужской род",
        "женский род",
        "средний род"
    ],

    "Наречие": [],

    "Неопределено" : [],

    "Предикатив" : [
        "настоящее время",
        "прошедшее время",
        "будущее время",
    ],

    "Предлог": [],

    "Прилагательное (краткое)": [
        "единственное число",
        "множественное число",
        "мужской род",
        "женский род",
        "средний род",
    ],

    "Прилагательное": [
        "именительный падеж",
        "родительный падеж",
        "дательный падеж",
        "винительный падеж",
        "творительный падеж",
        "предложный падеж",
        "единственное число",
        "множественное число",
        "мужской род",
        "женский род",
        "средний род",
    ],

    "Причастие (краткое)": [
        "единственное число",
        "множественное число",
        "мужской род",
        "женский род",
        "средний род",
        "совершенный вид",
        "несовершенный вид",
        "страдательный падеж",
        "действительный падеж"
    ],

    "Причастие (полное)": [
        "единственное число",
        "множественное число",
        "настоящее время",
        "прошедшее время",
        "будущее время",
        "мужской род",
        "женский род",
        "средний род",
        "повелительное наклонение",
        "изъявительное наклонение",
        "совершенный вид",
        "несовершенный вид",
        "непереходный",
        "переходный",
        "именительный падеж",
        "родительный падеж",
        "дательный падеж",
        "винительный падеж",
        "творительный падеж",
        "предложный падеж",
    ],

    "Союз": [],

    "Существительное": [
        "именительный падеж",
        "родительный падеж",
        "дательный падеж",
        "винительный падеж",
        "творительный падеж",
        "предложный падеж",
        "единственное число",
        "множественное число",
        "мужской род",
        "женский род",
        "средний род",
        "одушевленное",
        "неодушевленное"
    ],

    "Частица": [],

    "Числительное": [
        "именительный падеж",
        "родительный падеж",
        "дательный падеж",
        "винительный падеж",
        "творительный падеж",
        "предложный падеж",
        "одушевленное",
        "неодушевленное",
        "мужской род",
        "женский род",
        "средний род",
    ],
};